[
                {
                    "question": "После каждого нового сообщения о какой-то диете или более рациональном образе жизни вы…",
                    "otv": [
                        ["Сразу пересматриваете или даже меняете свой образ жизни, режим питания.", "a"],
                        ["Задумываетесь, что из всего этого может пригодиться и вам.", "b"],
			["Никогда не обращаете на это внимания (по вашему мнению, человечество уцелело потому, что никогда об этом не задумывалось).", "c"]
                    ]
                },
                {
                    "question": "Если на вашем лице выступила сыпь или вы поранили лицо при бритье, то вы…",
                    "otv": [
                        ["Не выходите из дома, пока лицо не заживет, так как вам кажется, что, если вы выйдете в таком виде, все будут обращать на вас внимание.", "g"],
                        ["Вы пытаетесь каким-то образом скрыть это, а как только встречаете кого-то из знакомых, сразу же объясняете, что с вами случилось.", "d"],
			["Вы не будете обращать на это внимания, любопытство посторонних вас не интересует.", "e"]
                    ]
                },
                {
                    "question": "Если вы почувствовали, что кто-то идет за вами и чуть ли не наступает вам на пятки, вы…",
                    "otv": [
                        ["Ускоряете шаг.", "b"],
                        ["Вам все равно, но из любопытства вы оглядываетесь и смотрите, кто это.", "c"],
                    ]
                },
                {
                    "question": "Вам нужно принять важное решение, и вы…",
                    "otv": [
                        ["Не говорите с другими потому, что боитесь получить противоречивые советы, которые собьют вас столку.", "g"],
                        ["Ищете совета, но в конце концов поступаете по-своему.", "d"],
			["Слушаетесь только самого себя.", "e"]
                    ]
                },
                {
                    "question": "Вы приболели, но не идете к врачу, потому что…",
                    "otv": [
                        ["Там много больных, которые станут рассказывать о своих недомоганиях, а это вас раздражает.", "a"],
                        ["У вас просто нет для этого времени, вы уверены, что все пройдет само собой.", "b"],
			["Врач может сказать вам что-то неприятное.", "c"]
                    ]
                },
                {
                    "question": "Если на новом месте работы, учебы все вдруг начинают твердить, что вы очень симпатичный человек, а на предыдущем месте у вас были проблемы в общении с людьми, то вы подумаете, что…",
                    "otv": [
                        ["Новые коллеги (студенты) правы, на старом месте вас просто не понимали.", "g"],
                        ["Они менее требовательны.", "d"],
			["Они более спокойны, философски ко всему относятся.", "e"]
                    ]
                },
		{
                    "question": "В театр, кино вы идете сразу, как только поймете, что герой, о котором идет речь…",
                    "otv": [
                        ["Похож на вас, у него те же проблемы, и вам интересно, как он их разрешит.", "a"],
                        ["Герой и обстановка совершенно не похожи на вашу, поэтому вам интересно все это сравнивать с собой.", "b"],
			["Вы смотрите с одинаковым удовольствием фильмы и спектакли, не сопоставляя героев с собой.", "c"]
                    ]
                },
		{
                    "question": "Если станут утверждать, что в последнее время ваша работа не отличается в лучшую сторону, то…",
                    "otv": [
                        ["Это сильно травмирует вас, вы начнете работать еще хуже.", "g"],
                        ["Так как вы сами не замечаете такого спада в работе, то решите, что вас хотят сбить с толку.", "d"],
			["Вы сами попробуете подвести итоги своей работы и заметите, что, хотя она и небезупречна, вы работаете с интересом и не хуже других.", "e"]
                    ]
                },
		{
                    "question": "Если шофер такси взглянет на вас с плохо скрываемой досадой, то вы…",
                    "otv": [
                        ["Решите, что вы ему просто не понравились.", "a"],
                        ["Что, может быть, он очень устал.", "b"],
			["Решите, что он, вероятно, вечно всем недоволен.", "c"]
                    ]
                },
		{
                    "question": "Как только вы вспоминаете о ваших бабушке и дедушке, с которыми не живете вместе, или о своих пожилых родителях, то…",
                    "otv": [
                        ["Вам прежде всего вспоминается запах в их доме, вы его буквально «чувствуете».", "g"],
                        ["Вам даже иногда «слышатся» их голоса.", "d"],
			["Вы видите расположение комнат, предметов в их доме.", "e"]
                    ]
                },   
		{
                    "question": "Тест окончен.",
		    "otv": [
			    ["Если ваши ответы составили прежде всего группу B и D, то можно сказать, вы достаточно спокойный, оптимистичный человек, который не лишен известной доли самокритики. Вы способны реагировать на перемены, но сначала старательно их осмысливаете, обсуждаете. Вы поддаетесь внушению прежде всего по отношению к тем вещам, которые больше всего вас волнуют.", "b"],
			    ["Если же в ваших ответах больше всего (или даже все) C и Е, то, боимся, вы слишком самонадеянны, слишком часто бываете излишне упрямы. Вы слишком легкомысленно относитесь ко многим важным вещам. Иногда вы готовы из вызова принять важное решение чуть ли не метанием «орла» и «решки» или каким-то другим совершенно случайным путем", "c" ]
			]
                }
]
