function visibleFunc() {
	document.querySelector('.ul2').classList.toggle('ul22')
}

function refreshFunc() {
	let indo = '';
	for(i=0;i<mass;i++){
		indo += `<li><input type="text"></li>`;
	}
	document.getElementById('ul1').innerHTML = indo;
	console.log(el)
	
}

function refreshAllFunc() {
	for (i = 0; i < massive.length; i++) {
		mas[i] = massive[i];
	}
	console.log(mas)
}
var schet = 0;

function numberFunc() {
	let n = -1;
	let m = mas.length;
	let a = Math.floor(Math.random() * (n - m + 1)) + m;
	el = a;
	document.querySelector('#h1').innerHTML = mas[a].name;
	mass = mas[a].ingridiens.length;
	var ing = '';
	for(i=0;i<mas[a].ingridiens.length;i++){
		ing += `<li>${mas[a].ingridiens[i]}</li>`
	}
	document.querySelector('.ul2').innerHTML = ing;
	schet += 1;
	document.getElementById('h2').innerHTML = schet;

	let ind = '';
	for(i=0;i<mas[a].ingridiens.length;i++){
		ind += `<li><input type="text"></li>`;
	}
	document.getElementById('ul1').innerHTML = ind;

	document.querySelector('.image').innerHTML = `<img src="${mas[a].img}" alt="">`

	mas.splice(a, 1)
	if (mas.length==0){
		for (i = 0; i < massive.length; i++) {
			mas[i] = massive[i];
		}
		schet = 0;
		document.getElementById('h2').innerHTML = schet;
		alert('конец')
	}

	
	console.log(mass)
	console.log(mas[el].ingridiens)
	console.log(el)
	console.log(a)
}

var massive = [
	{
		index: "salat",
		img: 'img/1.png',
		name: "тёплый салат с кальмаром",
		ingridiens: [
			"кальмар", "микс салата", "печенный картофель бэйби", "черри", "лимон", "грецкий орех", "стручковая фасоль", "медовое песто"
		]
	},
	{
		index: "salat",
		img: 'img/2.png',
		name: "салат с лососем и авокадо",
		ingridiens: [
			"аводкадо", "лосось домашнего посола",
			"свежий огурец", "табаджан", "икра мойвы", "кунжутное масло", "соус на самодельном майонезе", "помидоры канкасе", "печеная паприка"
		]
	},
	{
		index: "salat",
		img: 'img/3.png',
		name: "Витаминк ",
		ingridiens: ["подквашенная капуста на брусничном соке", "редька", "сельдерей", "мед", "ягоды брусники", "кубанское масло", "зелёное яблоко", "крымский лук", "грецкий орех", "тыквенные семечки"
		]
	},
	{
		index: "salat",
		img: 'img/4.png',
		name: "салат с ростбифом",
		ingridiens: ["салат айсберг", "ромейн", "огурцы", "ростбиф", "соус на самодельном майонезе с имбирём", "посыпается слайсами мендаля", "томаты черри"
		]
	},
	{
		index: "salat",
		img: 'img/5.png',
		name: "спелые томаты с брынзой",
		ingridiens: ["спелые томаты", "огурцы", "красныц болгарский перец", "фермерская брынза, обваленная в прованских травах", "маслины", "украшается крымским луком и базиликом", "заправка-самодельный томатно-базиликовый соус на основе оливкового масла"
		]
	},
	{
		index: "salat",
		img: 'img/6.png',
		name: "спелые томаты с козьим сыром",
		ingridiens: ["спелые томаты", "козий сыр", "укроп", "петрушка", "кинза", "зелёный лук", "тыквенные семечки", "заправка оливковое и тыквенное масла", "бальзамический крем"
		]
	},
	{
		index: "salat",
		img: 'img/8.png',
		name: "салат с яйцом пашот",
		ingridiens: ["перец", "огурец", "томаты", "лук красный", "семечки жаренные подсолнуха", "сметаной заправляется", "украшается листьями шпината", "добавляется яйцо пашот"
		]
	},
	{
		index: "salat",
		img: 'img/9.png',
		name: "деревенский на углях с курицей или креветками",
		ingridiens: ["курица или креветки запеченные на углях", "ромейн", "слайсы пшеничного багета", "перепелинное яйцо", "черри", "пармезан", "подается в свежеиспеченном хлебе", "заправка- самодельный майонез", "анчоусы", " каперсы", "пармезан", "чеснок", "яйцо", "зернистая горчика", "оливковое и подсолнечное масло"
		]
	},
	{
		index: "salat",
		img: 'img/7.png',
		name: "праздничный с домашней бужениной, с лососем",
		ingridiens: ["на выбор домашняя буженина или лосось собственного посола", "печеный картофель и морковь", "горошек", "соленые и свежие огурцы", "украшается перепелинным яцом", "красной икрой", "зеленым луком", "укропом", "петрушкой", "заправка-самодельный майонез", "подается с луковым хлебом"
		]
	},
	{
		index: "salat",
		img: 'img/10.png',
		name: "нежная мимоза",
		ingridiens: ["12 слоев из красной рыбы", "печеный картофель и морковь", "сыр", "отварные яйца", "зеленый лук", "заправка самодельный майонез"
		]
	},
	{
		index: "salat",
		img: 'img/11.png',
		name: "мурманская треска с картошкой",
		ingridiens: ["нежная печень мурманской трески", "печеный картофель в мундире", "отварное яйцо", "соленый огурец", "красный лук", "заправка-соус тар-тар", "сметана", "домашний майонез", "хрен", "чеснок", "маринованные огурцы", "укроп", "петрушка"
		]
	},
	{
		img: 'img/hold/1.png',
		name: "корзина хрустящих овощей и зелени со сметанным соусом",
		ingridiens: ["Огурцы,томаты,томаты чери,сельдерей,редис, сладкий перец+ зелень укроп,кинза, петрушка,базилик,листья салата"
		]
	},
	{
		img: 'img/hold/2.png',
		name: "маринады бочковые из погреба",
		ingridiens: ["Домашние малосолы - томаты, огурцы, квашенная с тмином и брусникой капуста, острая морковь. Отдельно подается кубанское масло"
		]
	},
	{
		img: 'img/hold/3.png',
		name: "соленья бочковые из погреба",
		ingridiens: [`Домашние соленья - томаты, огурцы, острая капуста, капуста квашенная в свекольном соке, маринованный чеснок, зеленые чили перцы, черемша. Также в соленья и маринады можно добавить соленые и малосольные огурцы. 
		`
		]
	},
	{
		img: 'img/hold/4.png',
		name: "бабушкино лечо",
		ingridiens: [`Лечо собственного приготовления. Сладкий болгарский перец, грунтовые томаты с добавлением чеснока и лука, томленые в горшочке. Подается с луковым хлебом.
		`
		]
	},
	{
		img: 'img/hold/5.png',
		name: "перцы в остром масле",
		ingridiens: [`Острые перцы и сладкие болгарские перцы с овощами (баклажан, морковь, лук), с добавлением чесночных слайсов, на оливковом масле первого отжима с пряными травами (тимьян, розмарин). Подается с луковым хлебом.
		`
		]
	},
	{
		img: 'img/hold/6.png',
		name: "икра кобочковая баклажанная",
		ingridiens: [`Кабачковая икра собственного приготовления с томатами и репчатым луком. Подается с луковым хлебом.
		`
		]
	},
	{
		img: 'img/hold/7.png',
		name: "лесные грибы",
		ingridiens: [`Маринованые маслята, лисички, груздьи, заправка (нерафинированное масло) с добавлением красного лука, чеснока и зелени. 
		`
		]
	},
	{
		img: 'img/hold/8.png',
		name: "ассорти три селедки",
		ingridiens: [`Филе сельди собственного бочкового засола (слабой соли), маринованное в тертом яблоке с хреном и горчицей, копченое на ольховой стружке, моченое на водке с укропом. Подается с зеленым луком. Украшается маринованным красным луком, зеленью и красным перцем
		`
		]
	},
	{
		img: 'img/hold/9.png',
		name: "селдка с молодой картошкой",
		ingridiens: [`Филе сельди собственного бочкового засола (слабой соли) с молодой разваренной картошкой с зеленью и красным луком. 
		`
		]
	},
	{
		img: 'img/hold/10.png',
		name: "красная рыба домашнего посола",
		ingridiens: [`Нежный лосось слабой соли, маринованный в розовом перце с зеленью.
		`
		]
	},
	{
		img: 'img/hold/11.png',
		name: "доска четыре сала",
		ingridiens: [`Сало из парного порося собственного засола: с чесноком и травами, валяное в золе и черном перце, копченое на вишневой косточке, сало-мазанка, рубленное с чесноком. Подается с 2 кусочками бородинского хлеба, домашней горчицей , хреном и крупной морской солью, дополняется веточкой укропа.
		`
		]
	},
	{
		img: 'img/hold/12.png',
		name: "фермерские копчености",
		ingridiens: [`Фермерские колбасы ( только свинина) Сервилат киевский, колбасак медовая, колбаса копченая от бабушки, шейка крильская, колбаса печеночная. Податся с горчицей, собственного приготовления.   
		`
		]
	},
	{
		img: 'img/hold/13.png',
		name: "строганина из оленины",
		ingridiens: [`Строганина из маринованного мяса (вырезка) степного оленя. Подается с олвковым маслом первого отжима с лимонным соком.
		`
		]
	},
	{
		img: 'img/hold/14.png',
		name: "дедушкина мясная тарелка",
		ingridiens: [`шпигованная чесноком и пряными травами буженина;  ростбиф, обжаренный в травах и перце с зерновой горчицей; куриный рулет  орехами (Фундук), черносливом и курагой; телячий язык с хреном  Подается с горчицей и хреном, собственного приготовления. 
		`
		]
	},
	{
		img: 'img/hold/15.png',
		name: "настоящие деревенские тушенки из добытого на охоте парного мяса и топленого сала",
		ingridiens: [`Настоящее дикое мясо (с охоты. Каждая тушенка готовиться с добавлением мокрови,лука, душистого перца, чеснока и лаврового листа. Подается с луковым хлебом.
		`
		]
	},
	{
		img: 'img/hold/16.png',
		name: "деревенский холодец",
		ingridiens: [`парная свинина и говядина, крепкий навар на ушах, хрящах, хвостах и копытах с  подпечёнными кореньями, чесноком и душистым перцем, подается с хреном, горчицей.В состав так же входит морковь.                                   
		`
		]
	},
	{
		img: 'img/hold/17.png',
		name: "выдержанные сыры",
		ingridiens: [`Эменталлер,пармезан,дорблю,чедр. Подается с медом, грецким орехом и виноградом.
		`
		]
	},
	// {
	// 	index: "salat",
	// 	img: '10.png',
	// 	name: "",
	// 	ingridiens: [
	// 	]
	// },
]


var mas = [];
var el = 0;

for (i = 0; i < massive.length; i++) {
	mas[i] = massive[i];
}
var mass = 0;

